tn1057/TestCrustifyHooks/stm32f4xx_can - Kopie.c
  *** Flags ***
  =============
    [..] The 15 flags can be divided on 4 groups:

      (+) Transmit Flags
        (++) CAN_FLAG_RQCP0,
        (++) CAN_FLAG_RQCP1,
        (++) CAN_FLAG_RQCP2  : Request completed MailBoxes 0, 1 and 2  Flags
                               Set when when the last request (transmit or abort)
                               has been performed.

      (+) Receive Flags


        (++) CAN_FLAG_FMP0,
        (++) CAN_FLAG_FMP1   : FIFO 0 and 1 Message Pending Flags
                               set to signal that messages are pending in the receive
                               FIFO.
                               These Flags are cleared only by hardware.

        (++) CAN_FLAG_FF0,
        (++) CAN_FLAG_FF1    : FIFO 0 and 1 Full Flags
                               set when three messages are stored in the selected
                               FIFO.

        (++) CAN_FLAG_FOV0
        (++) CAN_FLAG_FOV1   : FIFO 0 and 1 Overrun Flags
                               set when a new message has been received and passed
                               the filter while the FIFO was full.

      (+) Operating Mode Flags

        (++) CAN_FLAG_WKU    : Wake up Flag
                               set to signal that a SOF bit has been detected while
                               the CAN hardware was in Sleep mode.

        (++) CAN_FLAG_SLAK   : Sleep acknowledge Flag
                               Set to signal that the CAN has entered Sleep Mode.

      (+) Error Flags

        (++) CAN_FLAG_EWG    : Error Warning Flag
                               Set when the warning limit has been reached (Receive
                               Error Counter or Transmit Error Counter greater than 96).
                               This Flag is cleared only by hardware.

        (++) CAN_FLAG_EPV    : Error Passive Flag
                               Set when the Error Passive limit has been reached
                               (Receive Error Counter or Transmit Error Counter
                               greater than 127).
                               This Flag is cleared only by hardware.

        (++) CAN_FLAG_BOF    : Bus-Off Flag
                               set when CAN enters the bus-off state. The bus-off
                               state is entered on TEC overflow, greater than 255.
                               This Flag is cleared only by hardware.

        (++) CAN_FLAG_LEC    : Last error code Flag
                               set If a message has been transferred (reception or
                               transmission) with error, and the error code is hold.

  *** Interrupts ***
  ==================
    [..] The 14 interrupts can be divided on 4 groups:

      (+) Transmit interrupt

        (++) CAN_IT_TME   :  Transmit mailbox empty Interrupt
                             if enabled, this interrupt source is pending when
                             no transmit request are pending for Tx mailboxes.

      (+) Receive Interrupts

        (++) CAN_IT_FMP0,
        (++) CAN_IT_FMP1    :  FIFO 0 and FIFO1 message pending Interrupts
                               if enabled, these interrupt sources are pending
                               when messages are pending in the receive FIFO.
                               The corresponding interrupt pending bits are cleared
                               only by hardware.

        (++) CAN_IT_FF0,
        (++) CAN_IT_FF1     :  FIFO 0 and FIFO1 full Interrupts
                               if enabled, these interrupt sources are pending
                               when three messages are stored in the selected FIFO.

        (++) CAN_IT_FOV0,
        (++) CAN_IT_FOV1    :  FIFO 0 and FIFO1 overrun Interrupts
                               if enabled, these interrupt sources are pending
                               when a new message has been received and passed
                               the filter while the FIFO was full.

      (+) Operating Mode Interrupts

        (++) CAN_IT_WKU     :  Wake-up Interrupt
                               if enabled, this interrupt source is pending when
                               a SOF bit has been detected while the CAN hardware
                               was in Sleep mode.

        (++) CAN_IT_SLK     :  Sleep acknowledge Interrupt
                               if enabled, this interrupt source is pending when
                               the CAN has entered Sleep Mode.

      (+) Error Interrupts

        (++) CAN_IT_EWG     :  Error warning Interrupt
                               if enabled, this interrupt source is pending when
                               the warning limit has been reached (Receive Error
                               Counter or Transmit Error Counter=96).

        (++) CAN_IT_EPV     :  Error passive Interrupt
                               if enabled, this interrupt source is pending when
                               the Error Passive limit has been reached (Receive
                               Error Counter or Transmit Error Counter>127).

        (++) CAN_IT_BOF     :  Bus-off Interrupt
                               if enabled, this interrupt source is pending when
                               CAN enters the bus-off state. The bus-off state is
                               entered on TEC overflow, greater than 255.
                               This Flag is cleared only by hardware.

        (++) CAN_IT_LEC     :  Last error code Interrupt
                               if enabled, this interrupt source is pending  when
                               a message has been transferred (reception or
                               transmission) with error, and the error code is hold.

        (++) CAN_IT_ERR     :  Error Interrupt
                               if enabled, this interrupt source is pending when
                               an error condition is pending.

    [..] Managing the CAN controller events :

         The user should identify which mode will be used in his application to
         manage the CAN controller events: Polling mode or Interrupt mode.

